## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_key_vault.rcm_kv will be updated in-place
  ~ resource "azurerm_key_vault" "rcm_kv" {
      ~ access_policy                   = [
            {
                application_id          = null
                certificate_permissions = []
                key_permissions         = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "Decrypt",
                    "Encrypt",
                    "UnwrapKey",
                    "WrapKey",
                    "Verify",
                    "Sign",
                    "Purge",
                    "Release",
                    "Rotate",
                    "GetRotationPolicy",
                    "SetRotationPolicy",
                ]
                object_id               = "68469a57-c1fd-46d1-ba9c-c42616f8ea86"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "Purge",
                ]
                storage_permissions     = [
                    "Backup",
                    "Delete",
                    "DeleteSAS",
                    "Get",
                    "GetSAS",
                    "List",
                    "ListSAS",
                    "Purge",
                    "Recover",
                    "RegenerateKey",
                    "Restore",
                    "Set",
                    "SetSAS",
                    "Update",
                ]
                tenant_id               = "314aacf1-9610-4c50-bf5a-8ce5f8010819"
            },
          - {
              - certificate_permissions = []
              - key_permissions         = [
                  - "Get",
                  - "List",
                  - "UnwrapKey",
                  - "WrapKey",
                ]
              - object_id               = "56398b68-1397-4db1-b40e-13e56dc3e60f"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                ]
              - storage_permissions     = []
              - tenant_id               = "314aacf1-9610-4c50-bf5a-8ce5f8010819"
                # (1 unchanged attribute hidden)
            },
          - {
              - certificate_permissions = []
              - key_permissions         = [
                  - "Get",
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "Decrypt",
                  - "Encrypt",
                  - "UnwrapKey",
                  - "WrapKey",
                  - "Verify",
                  - "Sign",
                  - "Purge",
                ]
              - object_id               = "3603a805-8ec8-461c-90f5-de2fa73a73a6"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                  - "Set",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "Purge",
                ]
              - storage_permissions     = []
              - tenant_id               = "314aacf1-9610-4c50-bf5a-8ce5f8010819"
                # (1 unchanged attribute hidden)
            },
        ]
        id                              = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.KeyVault/vaults/vj-rcm-dev-kv"
        name                            = "vj-rcm-dev-kv"
        tags                            = {}
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_resource_group_template_deployment.terraform-arm-sql-ls will be created
  + resource "azurerm_resource_group_template_deployment" "terraform-arm-sql-ls" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "terraform-arm-sql-ls"
      + output_content      = (known after apply)
      + parameters_content  = (known after apply)
      + resource_group_name = "vj-rcm-dev-rg"
      + template_content    = jsonencode(
            {
              + "$schema"      = "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#"
              + apiProfile     = "2024-05-01-preview"
              + contentVersion = "1.0.0.0"
              + resources      = [
                  + {
                      + name       = "vj-rcm-dev-rg/vj-rcm-dev-adf/vj-rcm-dev-sql-ls"
                      + properties = {
                          + annotations    = []
                          + parameters     = {
                              + db_name = {
                                  + type = "string"
                                }
                            }
                          + type           = "AzureSqlDatabase"
                          + typeProperties = {
                              + authenticationType     = "SQL"
                              + database               = "@{linkedService().db_name}"
                              + encrypt                = "mandatory"
                              + password               = {
                                  + secretName = "vj-sqldb-access-key-dev"
                                  + store      = {
                                      + referenceName = "vj-rcm-dev-kv-ls"
                                      + type          = "LinkedServiceReference"
                                    }
                                  + type       = "AzureKeyVaultSecret"
                                }
                              + server                 = "vjrcmdevsql.database.windows.net"
                              + trustServerCertificate = false
                              + userName               = "azuresqladmin"
                            }
                        }
                      + type       = "Microsoft.DataFactory/factories/linkedservices@2018-06-01"
                    },
                ]
              + variables      = {}
            }
        )
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```
</details>